{"id":252,"date":"2022-04-07T13:14:29","date_gmt":"2022-04-07T13:14:29","guid":{"rendered":"http:\/\/localhost\/shrinebasilica\/\/?page_id=252"},"modified":"2022-08-16T09:44:44","modified_gmt":"2022-08-16T09:44:44","slug":"about-us","status":"publish","type":"page","link":"http:\/\/localhost\/shrinebasilica\/about-us\/","title":{"rendered":"About Us"},"content":{"rendered":"\t\t<div data-elementor-type=\"wp-page\" data-elementor-id=\"252\" class=\"elementor elementor-252\">\n\t\t\t\t\t\t\t\t\t<section class=\"elementor-section elementor-top-section elementor-element elementor-element-60c44328 elementor-section-stretched elementor-section-boxed elementor-section-height-default elementor-section-height-default\" data-id=\"60c44328\" data-element_type=\"section\" data-settings=\"{&quot;stretch_section&quot;:&quot;section-stretched&quot;}\">\n\t\t\t\t\t\t<div class=\"elementor-container elementor-column-gap-default\">\n\t\t\t\t\t<div class=\"elementor-column elementor-col-100 elementor-top-column elementor-element elementor-element-152ee8fc\" data-id=\"152ee8fc\" data-element_type=\"column\">\n\t\t\t<div class=\"elementor-widget-wrap elementor-element-populated\">\n\t\t\t\t\t\t\t\t<div class=\"elementor-element elementor-element-3570fd5a elementor-widget elementor-widget-text-editor\" data-id=\"3570fd5a\" data-element_type=\"widget\" data-widget_type=\"text-editor.default\">\n\t\t\t\t<div class=\"elementor-widget-container\">\n\t\t\t<style>\/*! elementor - v3.6.4 - 13-04-2022 *\/\n.elementor-widget-text-editor.elementor-drop-cap-view-stacked .elementor-drop-cap{background-color:#818a91;color:#fff}.elementor-widget-text-editor.elementor-drop-cap-view-framed .elementor-drop-cap{color:#818a91;border:3px solid;background-color:transparent}.elementor-widget-text-editor:not(.elementor-drop-cap-view-default) .elementor-drop-cap{margin-top:8px}.elementor-widget-text-editor:not(.elementor-drop-cap-view-default) .elementor-drop-cap-letter{width:1em;height:1em}.elementor-widget-text-editor .elementor-drop-cap{float:left;text-align:center;line-height:1;font-size:50px}.elementor-widget-text-editor .elementor-drop-cap-letter{display:inline-block}<\/style>\t\t\t\t<p> <\/p><p><img decoding=\"async\" loading=\"lazy\" class=\"size-full wp-image-1100 alignleft\" src=\"https:\/\/shrinebasilicabangalore.org\/wp-content\/uploads\/2022\/08\/madha.png\" alt=\"\" width=\"239\" height=\"265\" \/>The formation of the city of Bangalore and the beginning of St. Mary’s Church are found to be interlinked in the History of Karnataka. During the 17th Century, few Christians, hailing from Ginjee in the state of Tamil Nadu, settle down in the fertile land and gave the name ‘Bili akki palli’ because the rice they cultivated in that kind white and white birds flocked to the paddy fields. Being Christians, they built a small thatched roofed church and named it ‘KANIKKAI MADHA CHAPEL’.<br \/><br \/>The Italian Jesuits of the Malabar Mission were the founders of the Mysore Mission in the 17th Century. They were succeeded by the French Jesuits from Madura and Carnatic Missions in the 18th Century.<br \/><br \/>In 1799, at the siege of Srirangapatnam, Fr. Jean Dubois, a Catholic Priest, came with the English troops and only when he said the Mass in the Church, people did recognize him as a Catholic Priest. When the Cantonment was established in Bangalore, the Christians, both Europeans and Indians were attending the Mass said by Fr. Jean Dubois In 1811, he built a small chapel with a residence for priests. <br \/><br \/>Later on, Rev. Fr. Andreas an Indian priest from Pondicherry succeeded him and he enlarged the Church building in the shape of Cross, with a hall facing East and West and with two aisles North and South. <br \/><br \/>In 1832, due to some communal riots, the church was pulled and pillaged. Fr. Beauchaton, the Parish Priest, narrowly escaped death by the tactful handling of the situation by the Christian people. Troops arrived to restore peace and the government had the Church guarded first by the European soldiers and later by Indian sepoys for many months. After some years great plague had spread through out the Blackpalli and people sought the intercession of Mother Mary to relieve them from the clutches of disastrous death. Mother Mary interceded the victims’ prayers and the plague vanished from the vicinity. Since she cured the people from the dreadful disease and gave them good health, she was also called as ‘Annai Arokiamarie’ (Our Lady of Good Health).<br \/><br \/>In June 1875, the construction of present Church began during the time of then Parish Priest, Rev. Fr. E.L. Kleiner, who later became the Bishop of Mysore. In view of the historic importance of St. Mary’s Church, the then British authorities from Delhi were paying a grant every year already from the 19th Century for the maintenance of the Church till 1948.<br \/><br \/>The present Church of St. Mary’s built by Rev. Fr. Kleiner was solemnly consecrated on 8th September 1882 by Msgr. Joannes Maria Y. Coadou, Vicar Apostolic of Mysore, in the presence of 35 priests and about 4000 Catholics of Bangalore. It is interesting to note that, all the other parishes of Bangalore were born out of this ancient parish of St. Mary’s Church. <br \/><br \/>It was during the tenure of Most. Rev. Dr. P. Arokiaswamy, the then Archbishop of Bangalore and Rev. Fr. Paul Kinatukara, then Parish Priest of St. Mary’s Church, with the strenuous efforts of the Archbishop Most Rev. Dr. D.S. Lourdusamy, the then Secretary General for the Sacred Congregations for Evangelization of Peoples at Rome, Holy Father Pope Paul VI, elevated St. Mary’s Church to the title of ‘ANNAI AROCKIAMARIE BASILICA’ on 26th September 1973, which was officially announced and celebrated on 26th January 1974. Since then, every year this day stands as a remarkable significance of God’s grace. For several years a grand car procession carrying the Eucharist was held and the Archbishop administered solemn blessing of the Blessed Sacrament.<br \/><br \/>Due to increase in the population, and more devotees flooding to visit the Shrine of Our Lady, the space that was available for the devotees to stand and pray was found to be very congested. At this juncture, the then Parish Priest, Rev. Fr. T. Jabamalai, successor of Rev. Fr. Paul Kinatukara constructed a hall like structure facing east and placed the statue of Our Lady in a prominent place This enabled thousands of devotees to see her without any hindrance and pray to her more devotedly. The statue of Infant Jesus was placed where the Our Lady’s statue remained originally. During the year 2004, a new exquisite altar with tabernacle was erected by Msgr. T. Jabamalai, Parish Priest, who was also then Vicar General of the Bangalore Archdiocese. During the year 2005 – 2007, the church was completely renovated by him and was rededicated on 29th August 2006 by the present Archbishop of Bangalore, and (1882 &#8211; 2007) it celebrated 125th year of its consecration. During the month of June 2007, the Church and Shrine was bifurcated and His Grace the Archbishop of Bangalore appointed Rev. Fr. A.S. Anthony Swamy as the Parish Priest and Rev. Fr. L. Arulappa was the Rector of the Shrine. On 8th of September 2007, Annual Feast day and Birthday of Blessed Virgin Mary, His Grace the Archbishop officially declared and honoured this Basilica as the Diocesan Shrine. Rev. Fr. John Rose was the Rector cum Parish Priest of the Shrine Basilica from 22nd of June 2013 till 15th June 2019, and now Rev. Fr. Martin Kumar is the Rector cum Parish Priest of the Basilica.<br \/><br \/><strong>DESCRIPTION OF THE CHURCH<\/strong><br \/>St. Mary’s Basilica is a spacious gothic Church, designed by a French architect and built in the form of a Cross. It is 172 feet long and 50 feet broad. The imposing and magnificent tower forming the façade of the Church is 160 feet high. A beautiful statue of Mother Mary holding Child Jesus in her arms, 6 feet in height, set up in an attractive shrine just outside the Church building, is the chief object of veneration and source of inspiration for the people. Every day is draped in ‘Saree’ the typical dress of the Indian lady. It is said that in 1875 when the new Church was built, people tried to remove this statue in order to install it on a prominent altar inside the Church. But they failed in their effort since the statue remained immovable. This strange happening is considered even today as a sign of Our Lady’s miraculous power.<br \/><br \/>Contd.,………………….…..3.,<br \/><br \/><strong>MIRACULOUS STATUE OF OUR LADY<\/strong><br \/>At the main entrance of the Shrine you will find another Statue of Our Lady, a smaller one, which has a story behind it. It is believed to have happened in the year 1832, that the Church was attacked by some miscreants and every thing was destroyed except this small statue. It is also said that when they attempted to pull it down, they were struck blind. Soon police and military contingents arrived on the scene and restored just when the mob hat set fire to the Church. The statue thus miraculously saved, is the one that it placed in an imposing, flower decked, illuminated palanquin taken in procession during the important days of Marian devotion. It is true that for several years even Muslims were in the habit of taking out in solemn procession, the same statue of Our Lady.<br \/><br \/><strong>THE ANNUAL FEAST<\/strong><br \/>The Main feast is celebrated with all grandeur on the 8th of September, the Feast day of the Nativity of Blessed Virgin Mary, every year. This feast is considered by the people, not only as the Feast of the Parish, but also for the whole of the Archdiocese and State of Karnataka. <br \/><br \/>In preparation to the Feast, nine days novena is observed, wherein Holy Masses are celebrated through out the day, in which thousands of People participate with ardent devotion. Through the Feast the devotees are found to be dressed in ‘Saffron’ clothing. Archbishop blesses the flag and joins the Chief Guests in hoisting the flag. This hoisting of the flag symbolizes that our hearts too are to be raised towards the Almighty God with the perpetual help of Our Lady. Indeed it is spectacular to view when thousands of people gathered around the flag post, join in singing the praise of Mary Our Mother – ‘Ave Maria’ (Praise to Mary) fills the air, when the flag is hoisted. <br \/><br \/>According to the tradition, every day flag is hoisted beginning from the Flag Hoisting day till the ninth day of Novena. <br \/><br \/>On the Feast day, September 8th people gather in Lakhs, without any distinction of caste, creed or religion, not only from all parts of Bangalore, but also from all over India to pay their homage to Our Lady. The whole city embraces the festive mood on that day. Through out the day people flock in with lighted candles and flowers to pray and thank Mother Mary. In the evening, around 5.00 p.m. A grand car procession – a chariot carrying the 6 feet statue of Mother Mary, draped in a wonderful silk saree, with spectacular illuminations and decorations, is carried on the streets of Shivaji Nagar. <br \/><br \/>Mary, Mother of God is the mother of all generations, and she embraces everyone, without any discrimination of caste, creed, religion and language. While we approach her, all that we need to possess, is true faith and selfless love in her and her son Jesus. She is not the end of our lives, rather she is the one who will lead us safe, just like a mother who will lead her child by holding its little hands, to the eternal kingdom of God. GLORY TO GOD AND PRAISES TO MOTHER MARY.<br \/><br \/><strong>ST. MARY’S BASILICA<\/strong><br \/>Msgr. F. Noronha Road,<br \/>Shivaji Nagar,<br \/>BANGALORE – 560 051.<br \/><br \/><strong>Phone<\/strong>: 89513 92508 <br \/><strong>Email<\/strong>: shrinebasilicabangalore@gmail.com<\/p>\t\t\t\t\t\t<\/div>\n\t\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t<\/div>\n\t\t\t\t\t\t\t<\/div>\n\t\t<\/section>\n\t\t\t\t\t\t\t<\/div>\n\t\t","protected":false},"excerpt":{"rendered":"<p>  The formation of the city of Bangalore and the beginning of St. Mary’s Church are found to be interlinked in the History of Karnataka. During the 17th Century, few Christians, hailing from Ginjee in the state of Tamil Nadu, settle down in the fertile land and gave the name ‘Bili akki palli’ because the &hellip; <\/p>\n<p class=\"link-more\"><a href=\"http:\/\/localhost\/shrinebasilica\/about-us\/\" class=\"more-link\">Continue reading<span class=\"screen-reader-text\"> &#8220;About Us&#8221;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"footnotes":""},"_links":{"self":[{"href":"http:\/\/localhost\/shrinebasilica\/wp-json\/wp\/v2\/pages\/252"}],"collection":[{"href":"http:\/\/localhost\/shrinebasilica\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"http:\/\/localhost\/shrinebasilica\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"http:\/\/localhost\/shrinebasilica\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/localhost\/shrinebasilica\/wp-json\/wp\/v2\/comments?post=252"}],"version-history":[{"count":26,"href":"http:\/\/localhost\/shrinebasilica\/wp-json\/wp\/v2\/pages\/252\/revisions"}],"predecessor-version":[{"id":1331,"href":"http:\/\/localhost\/shrinebasilica\/wp-json\/wp\/v2\/pages\/252\/revisions\/1331"}],"wp:attachment":[{"href":"http:\/\/localhost\/shrinebasilica\/wp-json\/wp\/v2\/media?parent=252"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}